"""
Создайте файл my_calc.py и пропишите в нем минимум 4 функции, выполняющие базовые арифметические вычисления.
Примените эти функции в качестве методов в другом файле.
"""

import my_calc

print(my_calc.calculate(3, 9))
print(my_calc.divide(3, 9))
print(my_calc.multiplicate(3, 9))
print(my_calc.subtract(3, 9))
